results/cpu-vs-latency2/redis/1-1/nsl202.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:      303656 ops,   10118 (avg:   10121) ops/sec, 385.59KB/sec (avg: 385.02KB/sec),  0.09 (avg:  0.09) msec latency

1         Threads
1         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         920.20          ---          ---      0.09500        70.89
Gets        9201.64        16.27      9185.38      0.09400       314.14
Totals     10121.84        16.27      9185.38      0.09400       385.02


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.056      0.00036
GET       0.058      0.00217
GET       0.059      0.00398
GET       0.060      0.00688
GET       0.061      0.01413
GET       0.062      0.02101
GET       0.063      0.03478
GET       0.064      0.04782
GET       0.065      0.07245
GET       0.066      0.10143
GET       0.067      0.13838
GET       0.068      0.17714
GET       0.069      0.22750
GET       0.070      0.29198
GET       0.071      0.38073
GET       0.072      0.48143
GET       0.073      0.59410
GET       0.074      0.75421
GET       0.075      0.96794
GET       0.076      1.30194
GET       0.077      1.69824
GET       0.078      2.22713
GET       0.079      2.89477
GET       0.080      3.81598
GET       0.081      4.96251
GET       0.082      6.36950
GET       0.083      8.13476
GET       0.084     10.15432
GET       0.085     12.47238
GET       0.086     15.31534
GET       0.087     18.62815
GET       0.088     22.47346
GET       0.089     26.86108
GET       0.090     31.58993
GET       0.091     36.68973
GET       0.092     41.93045
GET       0.093     47.44249
GET       0.094     52.99583
GET       0.095     58.09346
GET       0.096     62.64843
GET       0.097     66.93896
GET       0.098     71.06213
GET       0.099     75.09944
GET       0.100     90.30248
GET       0.110     98.52780
GET       0.120     99.35483
GET       0.130     99.52038
GET       0.140     99.57471
GET       0.150     99.60514
GET       0.160     99.61927
GET       0.170     99.62434
GET       0.180     99.62978
GET       0.190     99.63268
GET       0.200     99.63557
GET       0.210     99.65151
GET       0.220     99.67107
GET       0.230     99.70078
GET       0.240     99.73266
GET       0.250     99.78084
GET       0.260     99.82431
GET       0.270     99.87901
GET       0.280     99.93443
GET       0.290     99.96740
GET       0.300     99.98587
GET       0.310     99.99167
GET       0.320     99.99384
GET       0.330     99.99565
GET       0.340     99.99602
GET       0.360     99.99638
GET       0.390     99.99710
GET       0.400     99.99746
GET       0.410     99.99783
GET       0.430     99.99819
GET       0.440     99.99891
GET       0.470     99.99928
GET       0.510     99.99964
GET       1.900    100.00000